Repository: OpenAva/OpenAva
Catalog: ChatKit/Sources/ChatUI/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Allow
zh_hans: 允许

source: Always allow for this exact request
zh_hans: 仅允许完全相同的此次请求

source: Always allow for this tool
zh_hans: 以后始终允许此工具

source: Arguments
zh_hans: 参数

source: Ask a question, run a skill, or call an Agent.
zh_hans: 您可以提问、运行技能，或唤起 Agent。

source: Ask anything or type / for skills
zh_hans: 发送任意问题，或输入 / 唤起技能

source: Attached %lld Documents
zh_hans: 已附加 %1$lld 个文档

source: Audio
zh_hans: 音频

source: Automatic compaction boundary
zh_hans: 自动压缩边界

source: Calculating context window...
zh_hans: 正在计算上下文窗口...

source: Camera
zh_hans: 相机

source: Camera is not available, please grant camera permission
zh_hans: 相机不可用，请授予相机权限

source: Cancel
zh_hans: 取消

source: Chat
zh_hans: 聊天

source: Compact Conversation
zh_hans: 压缩对话

source: Compact From Here
zh_hans: 从此处开始压缩

source: Compact Up to Here
zh_hans: 压缩至此处

source: Compacted %lld earlier messages
zh_hans: 压缩范围：%1$lld 条较早消息

source: Context --%
zh_hans: 上下文 --%

source: Context %lld%%
zh_hans: 上下文 %1$lld%%

source: Conversation compaction boundary
zh_hans: 历史压缩边界

source: Convert to Images
zh_hans: 转换为图片

source: Copy
zh_hans: 复制

source: Copy Details
zh_hans: 复制详情

source: Deny
zh_hans: 拒绝

source: Document
zh_hans: 文档

source: Error
zh_hans: 错误

source: Failed to load PDF file.
zh_hans: 加载 PDF 文件失败。

source: Failed to process audio file.
zh_hans: 处理音频文件失败。

source: Failed to process image.
zh_hans: 处理图片失败。

source: Failed to save text.
zh_hans: 保存文本失败。

source: File
zh_hans: 文件

source: Generating…
zh_hans: 正在生成…

source: Image
zh_hans: 图片

source: Image unavailable
zh_hans: 图片不可用

source: Import PDF
zh_hans: 导入 PDF

source: Import Text
zh_hans: 导入文本

source: Inference was cancelled.
zh_hans: 推理已取消。

source: Insert New Line
zh_hans: 插入新行

source: Loading image...
zh_hans: 正在加载图片…

source: Manual compaction boundary
zh_hans: 手动压缩边界

source: Microphone is not authorized.
zh_hans: 麦克风未获授权。

source: More
zh_hans: 更多

source: Network connection failed. Check your network or proxy settings, then try again.
zh_hans: 网络连接失败。请检查网络或代理设置后重试。

source: No response from model.
zh_hans: 模型没有返回内容。

source: OK
zh_hans: 确定

source: Open
zh_hans: 打开

source: Output truncated.
zh_hans: 输出被截断。

source: Paste as Attachment
zh_hans: 作为附件粘贴

source: Pasteboard
zh_hans: 剪贴板

source: PDF file is empty.
zh_hans: PDF 文件为空。

source: Photo
zh_hans: 照片

source: Preparing Transcript...
zh_hans: 正在准备转写...

source: Ready for Tasks
zh_hans: 随时准备就绪

source: Remember my choice
zh_hans: 记住我的选择

source: Request failed
zh_hans: 请求失败

source: Retry
zh_hans: 重试

source: Retrying...
zh_hans: 重试中...

source: Rollback
zh_hans: 回退

source: Run tool “%@”?
zh_hans: 允许运行工具“%1$@”？

source: Select All
zh_hans: 全选

source: Skip approval for any future call to this tool.
zh_hans: 后续调用此工具将跳过授权确认。

source: Skip approval only when the same arguments are used again.
zh_hans: 仅当后续调用使用完全相同的参数时才跳过授权。

source: Some messages have been removed to fit the model context length.
zh_hans: 为适应模型上下文长度，部分消息已被移除。

source: Speech recognizer is not authorized.
zh_hans: 语音识别未获授权。

source: Speech recognizer is not available.
zh_hans: 语音识别不可用。

source: Stop Transcript
zh_hans: 停止转写

source: Task execution interrupted, please retry.
zh_hans: 任务已中断，点击重试可重新发起

source: Technical details available
zh_hans: 可复制技术详情

source: Text Editor
zh_hans: 文本编辑器

source: Text too long.
zh_hans: 文本过长。

source: Text Viewer
zh_hans: 文本查看器

source: The conversation is over the model context limit. Compact earlier messages or start a shorter request, then try again.
zh_hans: 当前对话已超过模型上下文限制。请先压缩较早消息，或发送更短的请求后重试。

source: The model did not return any displayable content, and no provider error details were received. Check the selected model, API key/quota, network, or provider status, then try again.
zh_hans: 模型没有返回可展示内容，且服务商没有提供可读错误详情。请检查当前模型、API Key/额度、网络或服务商状态后重试。

source: The model provider returned an error, but did not include a readable message. Copy the details below for debugging.
zh_hans: 模型服务商返回了错误，但没有包含可读错误信息。你可以复制技术详情用于排查。

# The model provider returned an error: %@
source: The model provider returned an error: %1$@
zh_hans: 模型服务商返回错误：%1$@

source: This PDF has %lld page(s). Import as text or convert to images?
zh_hans: 这个 PDF 有 %1$lld 页。要导入为文本还是转换为图片？

source: Thought for %lld seconds
zh_hans: 已思考 %1$lld 秒

# Tool %@ failed: %@
source: Tool %1$@ failed: %2$@
zh_hans: 工具 %1$@ 执行失败：%2$@

source: Tool Arguments
zh_hans: 工具参数

source: Tool call for %@ completed.
zh_hans: 工具 %1$@ 调用已完成。

source: Tool call for %@ failed.
zh_hans: 工具 %1$@ 调用失败。

source: Tool call for %@ running
zh_hans: 工具 %1$@ 调用进行中

source: Tool executed successfully with no output
zh_hans: 工具执行成功，但没有输出。

source: Tool execution failed: %@
zh_hans: 工具执行失败：%1$@

source: Tool Result
zh_hans: 工具返回

source: Transcript Stopped
zh_hans: 转写已停止

source: Type something...
zh_hans: 输入点什么...

source: Unable to find tool: %@
zh_hans: 找不到工具：%1$@

source: Unsupported format.
zh_hans: 不支持的格式。

source: Utilizing tool call
zh_hans: 正在调用工具

source: Video unavailable
zh_hans: 视频不可用
